IRP/src/Catalogs/DataBaseStatus/DataBaseStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DataBaseStatus</name>
  <attributes>
    <name>isProduction</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SelectedStyle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ConnectionSettings</name>
    <attributes>
      <name>Computer</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionString</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Users</name>
 <attributes>
  <name>InfobaseUserID</name>
  <type>
   <types>UUID</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>LocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>5</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ShowInList</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UserGroup</name>
  <type>
   <types>CatalogRef.UserGroups</types>
  </type>
 </attributes>
 <attributes>
  <name>InterfaceLocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>5</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>FormScaleVariant</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Disable</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ChangePasswordOnNextLogin</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TimeZone</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>150</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UserID</name>
  <type>
   <types>DefinedType.typeBarcode</types>
  </type>
 </attributes>
 <attributes>
  <name>Email</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>OSUser</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/SessionParametersServer/Module.bsl
Procedure SessionParametersSetting(RequiredParameters) Export	
	If RequiredParameters = Undefined Then
		SessionParameters.ConnectionSettings = Catalogs.DataBaseStatus.GetOrCreateDataBaseStatusInfo();
		StyleName = SessionParameters.ConnectionSettings.SelectedStyle;
		If Not Metadata.Styles.Find(StyleName) = Undefined Then
			MainStyle = StyleLib[StyleName];
		EndIf;

		Return;
	EndIf;

	If RequiredParameters.Find("LocalizationCode") <> Undefined Then
		SessionParameters.LocalizationCode = Metadata.DefaultLanguage.LanguageCode;
	EndIf;
	If RequiredParameters.Find("InterfaceLocalizationCode") <> Undefined Then
		SessionParameters.InterfaceLocalizationCode = Metadata.DefaultLanguage.LanguageCode;
	EndIf;
	If RequiredParameters.Find("OurCompanies") <> Undefined Then
		SessionParameters.OurCompanies = OurCompanies();
	EndIf;
	If RequiredParameters.Find("Workstation") <> Undefined Then
		SessionParameters.Workstation = Catalogs.Workstations.EmptyRef();
	EndIf;
	If Saas.isAreaActive() Then
		CurrentUser = UsersEvent.SessionParametersSetCurrentUser();
		If RequiredParameters.Find("CurrentUser") <> Undefined Then
			SessionParameters.CurrentUser = CurrentUser;
		EndIf;
		If RequiredParameters.Find("CurrentUserPartner") <> Undefined Then
			SessionParameters.CurrentUserPartner = CurrentUser.Partner;
		EndIf;
		If CurrentUser.isEmpty() Then
			If RequiredParameters.Find("LocalizationCode") <> Undefined Then
				SessionParameters.LocalizationCode = Metadata.DefaultLanguage.LanguageCode;
			EndIf;
			If RequiredParameters.Find("InterfaceLocalizationCode") <> Undefined Then
				SessionParameters.InterfaceLocalizationCode = Metadata.DefaultLanguage.LanguageCode;
			EndIf;
		Else
			If RequiredParameters.Find("LocalizationCode") <> Undefined Then
				SessionParameters.LocalizationCode = CurrentUser.LocalizationCode;
			EndIf;
			If RequiredParameters.Find("InterfaceLocalizationCode") <> Undefined Then
				SessionParameters.InterfaceLocalizationCode = CurrentUser.InterfaceLocalizationCode;
			EndIf;
			If RequiredParameters.Find("CurrentUserAccessGroupList") <> Undefined Then
				SessionParameters.CurrentUserAccessGroupList = New FixedArray(UsersEvent.GetAccessGroupsByUser(CurrentUser));
			EndIf;			
		EndIf;
	Else
		If RequiredParameters.Find("CurrentUser") <> Undefined Then
			SessionParameters.CurrentUser = Catalogs.Users.EmptyRef();
		EndIf;
		If RequiredParameters.Find("LocalizationCode") <> Undefined Then
			SessionParameters.LocalizationCode = Metadata.DefaultLanguage.LanguageCode;
		EndIf;
		If RequiredParameters.Find("InterfaceLocalizationCode") <> Undefined Then
			SessionParameters.InterfaceLocalizationCode = Metadata.DefaultLanguage.LanguageCode;
		EndIf;
		If RequiredParameters.Find("CurrentUserPartner") <> Undefined Then
			SessionParameters.CurrentUserPartner = Catalogs.Partners.EmptyRef();
		EndIf;
	EndIf;
	If RequiredParameters.Find("ConnectedAddDataProc") <> Undefined Then
		SessionParameters.ConnectedAddDataProc = New FixedStructure();
	EndIf;
	If RequiredParameters.Find("RunBackgroundJobInDebugMode") <> Undefined Then
		SessionParameters.RunBackgroundJobInDebugMode = False;
	EndIf;
	If RequiredParameters.Find("IgnoreLockModificationData") <> Undefined Then
		SessionParameters.IgnoreLockModificationData = False;
	EndIf;
	If RequiredParameters.Find("Buffer") <> Undefined Then
		SessionParameters.Buffer = New ValueStorage(New Array);;
	EndIf;
EndProcedure

Function GetSessionParameter(ParameterName) Export
	Return SessionParameters[ParameterName];
EndFunction

Procedure SetSessionParameter(ParameterName, Value) Export
	SessionParameters[ParameterName] = Value;
EndProcedure

Function OurCompanies()
	OurCompanies = New Array();	
	If GetFunctionalOption("UseCompanies") = True Then
		Query = New Query();
		Query.Text = 
		"SELECT ALLOWED
		|	Companies.Ref
		|FROM
		|	Catalog.Companies AS Companies
		|WHERE
		|	Companies.OurCompany";
		QueryUnload = Query.Execute().Unload();
		OurCompanies = QueryUnload.UnloadColumn("Ref");
	Else
		OurCompanies.Add(Catalogs.Companies.Default);
	EndIf;
	Return New FixedArray(OurCompanies);
EndFunction

Procedure SetUserTimeZone() Export
	TimeZone = SessionParameters.CurrentUser.TimeZone;
	If Not IsBlankString(TimeZone) Then
		SetSessionTimeZone(TimeZone);
	EndIf;
EndProcedure
